Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A successful response only implies that the user agent's intent was achieved at the time of its processing by the origin server.
zh_cn: 成功的响应仅意味着用户代理的意图是在原始服务器处理时实现的。

source: A three way handshake is necessary because sequence numbers are not tied to a global clock in the network, and TCPs may have different mechanisms for picking the ISN's.
zh_cn: 三次握手是必要的，因为序列号不依赖于网络中的全局时钟，并且 TCP 可能具有用于挑选 ISN 的不同机制。

source: A toolbox of useful Operators for working with Observables
zh_cn: 用于处理 Observable 的有用操作符的工具箱

source: A transparent proxy MUST NOT rewrite the "abs_path" part of the received Request-URI when forwarding it to the next inbound server, except as noted above to replace a null abs_path with "/".
zh_cn: 透明代理在转发到下一个入站服务器时，不得重写收到的 Request-URI 的“abs_path”部分，除非是上面提到的用“/”替换 null abs_path。

source: A transport layer virtual circuit established between two programs for the purpose of communication.
zh_cn: 在两个程序之间建立的传输层虚电路，用于通信目的。

source: A tunnel acts as a relay point between two connections without changing the messages; tunnels are used when the communication needs to pass through an intermediary (such as a firewall) even when the intermediary cannot understand the contents of the messages.
zh_cn: 隧道充当两个连接之间的中继点而不改变消息；当通信需要通过中介(例如防火墙)时，即使中间人无法理解消息的内容，也会使用隧道。

source: A tunnel ceases to exist when both ends of the relayed connection are closed.
zh_cn: 当中继连接的两端都闭合时，隧道不再存在。

source: A tunnel is closed when a tunnel intermediary detects that either side has closed its connection: the intermediary MUST attempt to send any outstanding data that came from the closed side to the other side, close both connections, and then discard any remaining data left undelivered.
zh_cn: 当隧道中介检测到任何一方已关闭其连接时，隧道将关闭：中间设备必须尝试将来自关闭侧的任何未完成数据发送到另一侧，关闭两个连接，然后丢弃任何未传递的剩余数据。

source: A type alias T' for an existing type T is defined by:
zh_cn: 现有类型 T 的类型别名 T' 由以下定义：

source: A user agent MUST NOT automatically retry a request with a non-idempotent method unless it has some means to know that the request semantics are actually idempotent, regardless of the method, or some means to detect that the original request was never applied.
zh_cn: 用户代理不得使用非幂等方法自动重试请求，除非它有一些方法可以知道请求语义实际上是幂等的，无论方法如何，或者某些方法来检测原始请求从未应用过。

source: A user agent SHOULD NOT pipeline requests after a non-idempotent method, until the final response status code for that method has been received, unless the user agent has a means to detect and recover from partial failure conditions involving the pipelined sequence.
zh_cn: 用户代理不应该在非幂等方法之后对请求进行流水线处理，直到收到该方法的最终响应状态代码，除非用户代理具有检测和恢复涉及流水线序列的部分故障条件的方法。

source: A user agent SHOULD NOT send a Content-Length header field when the request message does not contain a payload body and the method semantics do not anticipate such a body.
zh_cn: 当请求消息不包含有效载荷主体且方法语义不预期这样的主体时，用户代理应该不发送 Content-Length 首部字段。

source: A user agent SHOULD distinguish between safe and unsafe methods when presenting potential actions to a user, such that the user can be made aware of an unsafe action before it is requested.
zh_cn: 在向用户呈现潜在操作时，用户代理应该区分安全和不安全方法，以便在请求用户之前可以使用户知道不安全的操作。

source: A user agent SHOULD send a Content-Length in a request message when no Transfer-Encoding is sent and the request method defines a meaning for an enclosed payload body.
zh_cn: 当没有发送 Transfer-Encoding 并且请求方法定义封闭的有效载荷主体的含义时，用户代理应该在请求消息中发送 Content-Length。

source: A user agent that receives an obs-fold in a response message that is not within a message/http container MUST replace each received obs-fold with one or more SP octets prior to interpreting the field value.
zh_cn: 在不在 message/http 容器中的响应消息中接收 obs 折叠的用户代理在解释字段值之前，必须用一个或多个 sp 八位字节替换每个接收到的 obs 折叠。

source: A user agent that sends a request containing a message body MUST send a valid Content-Length header field if it does not know the server will handle HTTP/1.1 (or later) requests; such knowledge can be in the form of specific user configuration or by remembering the version of a prior received response.
zh_cn: 发送包含消息体的请求的用户代理必须发送有效的 Content-Length 首部字段，如果它不知道服务器将处理 HTTP/1.1(或更高版本)请求；这种知识可以是特定用户配置的形式，或者通过记住先前接收的响应的版本。

source: A valid certificate chain or partial chain was received, but the certificate was not accepted because the CA certificate could not be located or couldn't be matched with a known, trusted CA.
zh_cn: 收到了有效的证书链或部分链，但未接受证书，因为无法找到 CA 证书或无法与已知的可信 CA 匹配。

source: A valid certificate was received, but when access control was applied, the sender decided not to proceed with negotiation.
zh_cn: 收到了有效证书，但是当应用访问控制时，发送者决定不继续协商。

source: A variable-length vector with an actual length field of zero is referred to as an empty vector.
zh_cn: 实际长度字段为零的可变长度 vector 被称为空 vector。

source: A variety of other cases are possible, all of which are accounted for by the following rules for RST generation and processing.
zh_cn: 可能存在各种其他情况，所有这些情况都由以下 RST 生成和处理规则来解释。

source: A vector (single-dimensioned array) is a stream of homogeneous data elements.
zh_cn: vector(单维数组)是同类数据元素的流。

source: A version of the timeout operator allows you to switch to a backup Single rather than sending an error notification if the timeout expires:
zh_cn: 超时操作符的一个版本允许你在超时到期时切换到备份的 Single，而不是发送错误通知：

source: A weak entity tag can only be used for weak comparison.
zh_cn: 弱实体标签只能用于弱比较。

source: A weight is normalized to a real number in the range 0 through 1, where 0 is the minimum and 1 the maximum value.
zh_cn: 权重归一化为 0 到 1 范围内的实数，其中 0 是最小值，1 是最大值。

source: A “cold” Observable, on the other hand, waits until an observer subscribes to it before it begins to emit items, and so such an observer is guaranteed to see the whole sequence from the beginning.
zh_cn: 另一方面，“冷” Observable 会一直等待，直到有观察者订阅它才开始发射数据项，因此观察者保证能从开头看到整个序列。

source: A “hot” Observable may begin emitting items as soon as it is created, and so any observer who later subscribes to that Observable may start observing the sequence somewhere in the middle.
zh_cn: “热” Observable 可能在创建后立即开始发射项目，因此任何后来订阅该 Observable 的观察者可能会在序列中间某处开始观察。

source: A() is defined as:
zh_cn: A() 定义为：

source: ACK: Acknowledgment field significant
zh_cn: ACK：指明确认字段

source: AEAD algorithms take as input a single key, a nonce, a plaintext, and "additional data" to be included in the authentication check, as described in Section 2.1 of [RFC5116].
zh_cn: AEAD 算法将单个密钥，随机数，明文和要包含在认证检查中的“附加数据”作为输入，如 [RFC5116] 的第 2.1 节所述。

source: AEAD ciphers take as input a single key, a nonce, a plaintext, and "additional data" to be included in the authentication check, as described in Section 2.1 of [AEAD].
zh_cn: AEAD 加密将单个密钥，随机数，明文和要包括在认证检查中的“附加数据”作为输入，如 [AEAD] 的第 2.1 节所述。

source: AEAD functions provide a unified encryption and authentication operation which turns plaintext into authenticated ciphertext and back again.
zh_cn: AEAD 功能提供统一的加密和认证操作，将明文转换为经过认证的密文，然后再返回。

source: API designers may instead choose to define `Observable<Object>` with no guarantee on what `Object` will be (which should be irrelevant anyway).
zh_cn: API 设计者可能会选择定义 `Observable<Object>` 而不保证 `Object` 将是什么(无论如何都应该是无关的)。

source: APIs marked with the [`@Beta`][beta source link] annotation at the class or method level are subject to change.
zh_cn: 在类或方法级别标有 [`@Beta`][beta source link] 注释的 API 可能会发生变化。

source: APIs marked with the [`@Experimental`][experimental source link] annotation at the class or method level will almost certainly change.
zh_cn: 在类或方法级别用 [`@Experimental`][experimental source link] 注释标记的 API 几乎肯定会改变。

source: APIs marked with the `@Deprecated` annotation at the class or method level will remain supported until the next major release but it is recommended to stop using them.
zh_cn: 在类或方法级别标记有 `@Deprecated` 注释的 API 将保持支持，直到下一个主要版本，但建议停止使用它们。

source: About This Document
zh_cn: 关于本文档

source: Absolute URI
zh_cn: 绝对 URI

source: Abstract
zh_cn: 摘要

source: Abuse of Server Log Information
zh_cn: 滥用服务器日志信息

source: Access Authentication
zh_cn: 访问验证

source: Accordingly, implementations that use static RSA keys MUST use RSA blinding or some other anti-timing technique, as described in [TIMING].
zh_cn: 因此，使用静态 RSA 密钥的实现必须使用 RSA 盲技术或其他一些反定时技术，如 [TIMING] 中所述。

source: Acknowledgement
zh_cn: 致谢

source: Acknowledgments
zh_cn: 致谢

source: Active Side Causes Half-Open Connection Discovery
zh_cn: 活动侧导致半开连接发现

source: Actually, it is a little more complicated than this.
zh_cn: 实际上，它比这复杂一点。

source: Additional (social) requirements are placed on implementations, resource owners, and protocol element registrations when they apply beyond the scope of a single communication.
zh_cn: 当实现，资源所有者和协议元素注册超出单个通信的范围时，其他(社交)要求被放置在实现，资源所有者和协议元素注册上。

source: Additional Features
zh_cn: 附加功能

source: Additional fields and/or messages may also be present for middlebox compatibility.
zh_cn: 还可以存在用于中间盒兼容性的附加字段和/或消息。

source: Additional information about the encoding parameters can be provided by other header fields not defined by this specification.
zh_cn: 有关编码参数的其他信息可以由本规范未定义的其他首部字段提供。

source: Additional methods, outside the scope of this specification, have been standardized for use in HTTP.
zh_cn: 在本说明书范围之外的其他方法已被标准化以用于 HTTP。

source: Additional tokens ought to be registered with IANA using the registration procedure defined in Section 8.6.
zh_cn: 其他标记应使用第 8.6 节中定义的注册程序在 IANA 注册。

source: Additionally, a ServerKeyExchange message may be sent, if it is required (e.g., if the server has no certificate, or if its certificate is for signing only).
zh_cn: 另外，如果需要，可以发送 ServerKeyExchange 消息(例如，如果服务器没有证书，或者其证书仅用于签名)。

source: Additionally, care has been taken to reduce network activity.
zh_cn: 此外，已经注意减少网络活动。

source: Additionally, it SHOULD contain the minimal set of extensions necessary for the client to generate a correct ClientHello pair.
zh_cn: 此外，它应该包含客户端生成正确的 ClientHello 对所需的最小扩展集。

source: Additionally, this document clarifies some compliance requirements for earlier versions of TLS; see Section 9.3.
zh_cn: 此外，本文档阐明了早期版本 TLS 的一些合规性要求；见 9.3 节。

source: Additionally, two random values are generated and exchanged: ClientHello.random and ServerHello.random.
zh_cn: 此外，生成并交换了两个随机值：ClientHello.random 和 ServerHello.random。

source: Additionally, version numbers have been restricted to single digits, due to the fact that implementations are known to handle multi-digit version numbers incorrectly.
zh_cn: 此外，由于已知实现不正确地处理多位数版本号，因此版本号限制为单个数字。

source: Advice for designers of new URI schemes can be found in [RFC2718].
zh_cn: 有关新 URI 方案的设计者的建议可以在 [RFC2718] 中找到。

source: After TCP A crashes, the user attempts to re-open the connection.
zh_cn: TCP A 崩溃后，用户尝试重新打开连接。

source: After receiving and interpreting a request message, a server responds with an HTTP response message.
zh_cn: 在接收并解释请求消息之后，服务器以 HTTP 响应消息进行响应。

source: After receiving the server's Finished message, if the server has accepted early data, an EndOfEarlyData message will be sent to indicate the key change.
zh_cn: 在收到服务器的已完成消息后，如果服务器已接受早期数据，则将发送 EndOfEarlyData 消息以指示密钥更改。

source: After sending a HelloRequest, servers SHOULD NOT repeat the request until the subsequent handshake negotiation is complete.
zh_cn: 发送 HelloRequest 后，服务器不应重复请求，直到后续握手协商完成。

source: After sending the ClientHello message, the client waits for a ServerHello message.
zh_cn: 发送 ClientHello 消息后，客户端等待 ServerHello 消息。

source: After sending the ClientHello message, the client waits for a ServerHello or HelloRetryRequest message.
zh_cn: 发送 ClientHello 消息后，客户端等待 ServerHello 或 HelloRetryRequest 消息。

source: After sending this message, the server will wait for a client response.
zh_cn: 发送此消息后，服务器将等待客户端响应。

source: Agent-driven Negotiation
zh_cn: 代理驱动的协商

source: Alert Protocol
zh_cn: 警报协议

source: Alert messages (Section 6) MUST NOT be fragmented across records, and multiple alert messages MUST NOT be coalesced into a single TLSPlaintext record.
zh_cn: 警报消息(第 6 节)不得在记录之间进行分段，并且多条警报消息不得合并为单个 TLSPlaintext 记录。

source: Alert messages convey the severity of the message (warning or fatal) and a description of the alert.
zh_cn: 警报消息传达消息的严重性(警告或致命)以及警报的描述。

source: Alert messages with a level of fatal result in the immediate termination of the connection.
zh_cn: 具有致命级别的警报消息导致立即终止连接。

source: Algorithms which traditionally act on a digest should be defined in TLS to first hash the input with a specified hash algorithm and then proceed as usual.
zh_cn: 传统上对摘要起作用的算法应该在 TLS 中定义，首先使用指定的散列算法对输入进行散列，然后照常进行。

source: All 1xx (Informational), 204 (No Content), and 304 (Not Modified) responses do not include a message body.
zh_cn: 所有 1xx(信息)，204(无内容)和 304(未修改)响应都不包含消息正文。

source: All 1xx (informational), 204 (no content), and 304 (not modified) responses MUST NOT include a message-body.
zh_cn: 所有 1xx(信息)，204(无内容)和 304(未修改)响应不得包含消息主体。

source: All HTTP data MUST be sent as TLS "application data".
zh_cn: 所有 HTTP 数据必须作为 TLS“应用程序数据”发送。

source: All HTTP date/time stamps MUST be represented in Greenwich Mean Time (GMT), without exception.
zh_cn: 所有 HTTP 日期/时间戳必须以格林威治标准时间(GMT)表示，无一例外。

source: All HTTP requirements applicable to an origin server also apply to the outbound communication of a gateway.
zh_cn: 适用于源服务器的所有 HTTP 要求也适用于网关的出站通信。

source: All HTTP/1.1 applications MUST be able to receive and decode the "chunked" transfer-coding, and MUST ignore chunk-extension extensions they do not understand.
zh_cn: 所有 HTTP/1.1 应用程序必须能够接收和解码“分块”传输编码，并且必须忽略他们不理解的块扩展扩展。

source: All HTTP/1.1 applications that receive entities MUST accept the "chunked" transfer-coding (section 3.6), thus allowing this mechanism to be used for messages when the message length cannot be determined in advance.
zh_cn: 接收实体的所有 HTTP/1.1 应用程序必须接受“chunked”传输编码(第 3.6 节)，从而允许在无法提前确定消息长度时将此机制用于消息。

source: All HTTP/1.1 messages consist of a start-line followed by a sequence of octets in a format similar to the Internet Message Format [RFC5322]: zero or more header fields (collectively referred to as the "headers" or the "header section"), an empty line indicating the end of the header section, and an optional message body.
zh_cn: 所有 HTTP/1.1 消息都包含一个起始行，后跟一系列八位字节，格式类似于互联网消息格式 [RFC5322]：零个或多个首部字段（统称为“首部 (headers)”或“首部部分”） ），一个表示首部部分结尾的空行和一个可选的消息体。

source: All SHA-1 signature algorithms in this specification are defined solely for use in legacy certificates and are not valid for CertificateVerify signatures.
zh_cn: 本规范中的所有 SHA-1 签名算法仅定义用于旧证书，并且对 CertificateVerify 签名无效。

source: All TLS 1.3 ServerHello messages MUST contain the "supported_versions" extension.
zh_cn: 所有 TLS 1.3 ServerHello 消息必须包含“supported_versions”扩展。

source: All block cipher encryption is done in CBC (Cipher Block Chaining) mode, and all items that are block-ciphered will be an exact multiple of the cipher block length.
zh_cn: 所有分组密码加密都在 CBC (Cipher Block Chaining) 模式下完成，并且所有被块加密的项目将是密码块长度的精确倍数。

source: All certificates provided by the server MUST be signed by a signature algorithm advertised by the client if it is able to provide such a chain (see Section 4.2.3).
zh_cn: 服务器提供的所有证书必须由客户通告的签名算法签名，如果它能够提供这样的链(见 4.2.3 节)。

source: All cipher suites in this document use P_SHA256.
zh_cn: 本文档中的所有密码套件均使用 P_SHA256。

source: All code inside the `io.reactivex.internal.*` packages is considered private API and should not be relied upon at all.
zh_cn: `io.reactivex.internal.*` 包中的所有代码都被视为私有 API，根本不应该依赖它们。

source: All content-coding values are case-insensitive.
zh_cn: 所有内容编码值都不区分大小写。

source: All defined header fields ought to be registered with IANA in the "Message Headers" registry, as described in Section 8.3 of [RFC7231].
zh_cn: 所有定义的首部字段都应该在 IANA 的“消息首部”注册表中注册，如 [RFC7231] 的第 8.3 节所述。

source: All endpoints are RECOMMENDED to transition to SHA-256 or better as soon as possible to maintain interoperability with implementations currently in the process of phasing out SHA-1 support.
zh_cn: 建议所有端点尽快过渡到 SHA-256 或更好，以保持与当前正在逐步取消 SHA-1 支持的实现的互操作性。

source: All general-purpose servers MUST support the methods GET and HEAD.
zh_cn: 所有通用服务器必须支持 GET 和 HEAD 方法。

source: All larger numeric data types are constructed from a fixed-length series of bytes concatenated as described in Section 3.1 and are also unsigned.
zh_cn: 所有较大的数字数据类型都是按照 3.1 节所述连接的固定长度字节串构造的，并且也是无符号的。

source: All larger numeric data types are formed from fixed-length series of bytes concatenated as described in Section 4.1 and are also unsigned.
zh_cn: 所有较大的数字数据类型都是由第 4.1 节所述连接的固定长度字节串组成，也是无符号的。

source: All linear white space, including folding, has the same semantics as SP.
zh_cn: 所有线性空白区域(包括折叠)都具有与 SP 相同的语义。

source: All multipart types share a common syntax, as defined in section 5.1.1 of RFC 2046 [40], and MUST include a boundary parameter as part of the media type value.
zh_cn: 所有 multipart 类型共享一个通用语法，如 RFC 2046 [40] 的 5.1.1 节中所定义，并且必须包含边界参数作为媒体类型值的一部分。

source: All of the data from all messages in this handshake (not including any HelloRequest messages) up to, but not including, this message.
zh_cn: 此握手中的所有消息(不包括任何 HelloRequest 消息)的数据，直到（但不包括）该消息。

source: All of the mechanisms specified in this document are described in both prose and an augmented Backus-Naur Form (BNF) similar to that used by RFC 822 [9].
zh_cn: 本文档中指定的所有机制都以散文和增强的 Backus-Naur 形式(BNF)描述，类似于 RFC 822 [9] 使用的形式。

source: All of the requirements listed above for the "http" scheme are also requirements for the "https" scheme, except that TCP port 443 is the default if the port subcomponent is empty or not given, and the user agent MUST ensure that its connection to the origin server is secured through the use of strong encryption, end-to-end, prior to sending the first HTTP request.
zh_cn: 上面列出的“http”方案的所有要求也是“https”方案的要求，但如果端口子组件为空或未给出，TCP 端口默认值是 443，并且用户代理必须确保其到源服务器的连接，在发送第一个 HTTP 请求之前，通过端到端使用强加密来保护。

source: All options are included in the checksum.
zh_cn: 所有选项都包含在校验和中。

source: All other methods are OPTIONAL.
zh_cn: 所有其他方法都是可选的。

source: All other methods are OPTIONAL; however, if the above methods are implemented, they MUST be implemented with the same semantics as those specified in section 9.
zh_cn: 所有其他方法都是可选的；但是，如果实现上述方法，则必须使用与第 9 节中指定的语义相同的语义来实现它们。

source: All other responses do include a message body, although the body might be of zero length.
zh_cn: 所有其他响应都包含消息正文，尽管正文可能长度为零。

source: All other responses do include a message-body, although it MAY be of zero length.
zh_cn: 所有其他响应都包含一个消息主体，尽管它的长度可能为零。

source: All records are compressed using the compression algorithm defined in the current session state.
zh_cn: 使用当前会话状态中定义的压缩算法压缩所有记录。

source: All records are processed under the current read and write states.
zh_cn: 所有记录都在当前读写状态下处理。

source: All responses to the HEAD request method MUST NOT include a message-body, even though the presence of entity- header fields might lead one to believe they do.
zh_cn: 对 HEAD 请求方法的所有响应都不得包含消息主体，即使实体首部字段的存在可能导致人们以为它们包含消息主体。

source: All segments preceding and including FIN will be retransmitted until acknowledged.
zh_cn: FIN 之前（包含 FIN ）的所有报文段都将被重传，直到被确认为止。

source: All significant changes from RFC 2396 are noted in Appendix D.
zh_cn: 从 RFC 2396 的所有重大更改都在附录 D 中注明。

source: All significant changes from the prior RFCs are noted in Appendix G.
zh_cn: 附录 G 中记录了之前 RFC 的所有重大变化。

source: All such methods ought to be registered within the "Hypertext Transfer Protocol (HTTP) Method Registry" maintained by IANA, as defined in Section 8.1.
zh_cn: 所有这些方法都应该在 IANA 维护的“超文本传输​​协议(HTTP)方法注册表”中注册，如第 8.1 节中所定义。

source: All that remains is to calculate the master secret.
zh_cn: 剩下的工作就是计算主密钥。

source: All the traffic keying material is recomputed whenever the underlying Secret changes (e.g., when changing from the handshake to Application Data keys or upon a key update).
zh_cn: 每当底层机密改变时(例如，当从握手改变为应用数据密钥或密钥更新时)，将重新计算所有通信密钥材料。

source: All transfer-coding values are case-insensitive.
zh_cn: 所有传输编码值都不区分大小写。

source: All values, here and elsewhere in the specification, are stored in network byte (big-endian) order; the uint32 represented by the hex bytes 01 02 03 04 is equivalent to the decimal value 16909060.
zh_cn: 所有值，在此处和规范中的其他地方，都以网络字节(big-endian)顺序存储；由十六进制字节 01 02 03 04 表示的 uint32 等效于十进制值 16909060。

source: All values, here and elsewhere in the specification, are transmitted in network byte (big-endian) order; the uint32 represented by the hex bytes 01 02 03 04 is equivalent to the decimal value 16909060.
zh_cn: 所有值，在此处和规范中的其他地方，都以网络字节(big-endian)顺序传输；由十六进制字节 01 02 03 04 表示的 uint32 等效于十进制值 16909060。

source: All versions of TLS allow an extensions field to optionally follow the compression_methods field.
zh_cn: 所有版本的 TLS 都允许扩展字段可选地遵循 compression_methods 字段。

source: Also, "hop-by-hop" header fields are required to appear in the Connection header field; just because they're defined as hop-by-hop in this specification doesn't exempt them.
zh_cn: 此外，“逐跳”首部字段需要出现在 Connection 首部字段中；仅仅因为它们在本规范中被逐跳定义并不能免除它们。

source: Also, HelloRequest messages are omitted from handshake hashes.
zh_cn: 此外，握手哈希中省略了 HelloRequest 消息。

source: Also, PKCS #7 defines a SET rather than a SEQUENCE, making the task of parsing the list more difficult.
zh_cn: 此外，PKCS #7 定义了 SET 而不是 SEQUENCE，使得解析列表的任务更加困难。

source: Also, each implementation tends to name its operators to resemble those of similar methods that are already familiar from other contexts in that language.
zh_cn: 此外，每个实现都倾向于将其操作符命名为类似于该语言中其他上下文已熟悉的类似方法的操作符。

source: Also, if some aspect of the certificate chain was unacceptable (e.g., it was not signed by a known, trusted CA), the server MAY at its discretion either continue the handshake (considering the client unauthenticated) or abort the handshake.
zh_cn: 此外，如果证书链的某些方面是不可接受的(例如，它没有由已知的可信 CA 签名)，则服务器可以自行决定是继续握手(考虑客户端未经认证)还是中止握手。

source: Also, if some aspect of the certificate chain was unacceptable (e.g., it was not signed by a known, trusted CA), the server MAY at its discretion either continue the handshake (considering the client unauthenticated) or send a fatal alert.
zh_cn: 此外，如果证书链的某些方面是不可接受的(例如，它未由已知的可信 CA 签名)，则服务器可以自行决定是继续握手(考虑客户端未经身份验证)还是发送致命警报。

source: Also, some extraneous requirements about when servers are allowed to close connections prematurely have been removed.
zh_cn: 此外，还删除了一些关于何时允许服务器过早关闭连接的无关要求。

source: Also, the handshake_messages for the Finished message sent by the client will be different from that for the Finished message sent by the server, because the one that is sent second will include the prior one.
zh_cn: 另外，由客户端发送的 Finished 消息的 handshake_messages 将不同于由服务器发送的 Finished 消息，因为第二次发送的将包括前一个。

source: Also, the methods OPTIONS and TRACE SHOULD NOT have side effects, and so are inherently idempotent.
zh_cn: 此外，方法 OPTIONS 和 TRACE 不应该有副作用，因此本质上是幂等的。

source: Alternatively, the `Flowable.parallel()` operator and the `ParallelFlowable` type help achieve the same parallel processing pattern:
zh_cn: 或者，`Flowable.parallel()` 运算符和 `ParallelFlowable` 类型有助于实现相同的并行处理模式：

source: Alternatively, the `doFinally` operator (introduced in 2.0.1 and standardized in 2.1) calls a developer specified `Action` that gets executed after a source completed, failed with an error or got cancelled/disposed:
zh_cn: 或者，`doFinally` 操作符(在 2.0.1 中引入，在 2.1 中标准化)调用开发人员指定的 `Action`，它在源完成后，带错误失败或被取消/释放时执行：

source: Alternatively, you can use the `subscribe(Consumer<T>, Consumer<Throwable>, Action)` (and similar) methods to provide a callback/lambda that can throw:
zh_cn: 或者，您可以使用 `subscribe(Consumer<T>, Consumer<Throwable>, Action)`(和类似的)方法来提供可以抛出的回调/lambda：

source: Alternatives have also been explored, for example, T/TCP [27].
zh_cn: 还探讨了替代方案，例如 T/TCP [27]。

source: Although HTTP allows an arbitrary token to be used as a charset value, any token that has a predefined value within the IANA Character Set registry [19] MUST represent the character set defined by that registry.
zh_cn: 虽然 HTTP 允许将任意标记用作字符集值，但在 IANA 字符集注册表 [19] 中具有预定义值的任何标记必须表示该注册表定义的字符集。

source: Although HTTP is independent of the transport protocol, the "http" scheme is specific to TCP-based services because the name delegation process depends on TCP for establishing authority.
zh_cn: 虽然 HTTP 独立于传输协议，但“http”方案特定于基于 TCP 的服务，因为名称委派过程依赖于 TCP 来建立权限。
